---
kind: property
id: P:Autodesk.Revit.DB.Visual.AssetPropertyDouble.Value
source: html/6a9cb5f5-17f5-4b37-daea-27e4a03e72d8.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyDouble.Value Property

The value of the property.

## Syntax (C#)
```csharp
public double Value { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The input value is invalid for this AssetPropertyDouble property.
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: The asset property is not editable.